-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/merger/Analysis/Data Checks/code/../
> output/analysis.log
  log type:  text
 opened on:   4 Oct 2020, 00:07:17

. 
. foreach file in fsolve_100 fsolve_200 fsolve_500 fsolve_1000 zeta_1000 {
  2.     import delimited using ../temp/`file'.csv, clear
  3.     rename v1 j
  4.     rename v2 t
  5.     rename v3 x
  6.     rename v4 sat
  7.     rename v5 wire
  8.     rename v6 p
  9.     rename v7 w
 10.     rename v8 xi
 11.     rename v9 omega
 12.     rename v10 s
 13.     rename v11 mc
 14.     save ../temp/`file'.dta, replace
 15. }
(16 vars, 2,400 obs)
(note: file ../temp/fsolve_100.dta not found)
file ../temp/fsolve_100.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/fsolve_200.dta not found)
file ../temp/fsolve_200.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/fsolve_500.dta not found)
file ../temp/fsolve_500.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/fsolve_1000.dta not found)
file ../temp/fsolve_1000.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/zeta_1000.dta not found)
file ../temp/zeta_1000.dta saved

. 
. use ../temp/fsolve_100.dta, clear

. rename p p_f100 

. rename s s_f100

. merge 1:1 j t x using ../temp/fsolve_200.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_f200

. rename s s_f200

. merge 1:1 j t x using ../temp/fsolve_500.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_f500

. rename s s_f500

. merge 1:1 j t x using ../temp/fsolve_1000.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_f1000

. rename s s_f1000

. merge 1:1 j t x using ../temp/zeta_1000.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_z1000

. rename s s_z1000

. 
. foreach v in x sat wire w xi omega mc {
  2.     sum `v'
  3.     matrix row = r(N), r(mean), r(sd), r(min), r(max)
  4.     matrix exog_stats = nullmat(exog_stats) \ row
  5. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           x |      2,400    .8058188    .6211158   .0000291    3.45622

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         sat |      2,400          .5    .5001042          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        wire |      2,400          .5    .5001042          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           w |      2,400    .8016445     .600155   .0000186    3.24744

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          xi |      2,400   -.0054473    1.003189  -3.630091   3.258934

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       omega |      2,400   -.0361855    .9937776  -4.240944    3.67225

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          mc |      2,400    2.044951    .4208522   1.239474   4.109324

. matrix rownames exog_stats = x sat wire w xi omega mc

. matrix colnames exog_stats = N Mean SD Min Max

. outtable using ../output/exog_stats, mat(exog_stats) ///
>   format(%9.0fc %9.2fc %9.2fc %9.5fc %9.2fc) nobox 

. 
. foreach suff in f100 f200 f500 f1000 z1000 {
  2.     gen mu_`suff' = p_`suff' - mc
  3.     foreach v in p mu s {
  4.         summ `v'_`suff'
  5.         matrix col = r(mean) \ r(sd) \ r(min) \ r(max)
  6.         matrix endog_stats = nullmat(endog_stats), col
  7.     }
  8. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      p_f100 |      2,400    2.744953    .3897018   1.851048    4.61061

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     mu_f100 |      2,400    .7000016    .1644271   .5011096   1.666923

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      s_f100 |      2,400    .1900707    .1239075   .0015282   .6711953

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      p_f200 |      2,400     2.73126    .3898319   1.846063   4.610384

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     mu_f200 |      2,400    .6863085    .1581363   .5010605   1.652358

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      s_f200 |      2,400     .186055    .1241636   .0011036   .6771971

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      p_f500 |      2,400    2.736167    .3896751   1.849624   4.610445

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     mu_f500 |      2,400    .6912163    .1588906   .5011215   1.646176

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      s_f500 |      2,400     .185088    .1228265   .0011953   .6740277

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p_f1000 |      2,400    2.739301    .3895752   1.849136   4.610495

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    mu_f1000 |      2,400    .6943496    .1608491   .5011706   1.654471

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     s_f1000 |      2,400    .1851841    .1217747   .0012142   .6750922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p_z1000 |      2,400    2.734638    .3898275   1.847271   4.610464

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    mu_z1000 |      2,400    .6896866    .1583495   .5011401   1.641283

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     s_z1000 |      2,400    .1853774    .1234382   .0012373   .6747692

. 
. matrix bottom = 1 \ 1 \ 1

. matrix bottom = bottom, bottom, bottom

. foreach v in p mu s {
  2.     corr `v'_f200 `v'_f100
  3.     matrix col = r(rho)  
  4.     gen d`v'= abs(`v'_f200 - `v'_f100)
  5.     summ d`v'
  6.     matrix col = col \ r(mean) \ r(max)
  7.     matrix bottom = bottom, col
  8.     drop d`v'
  9. }
(obs=2,400)

             |   p_f200   p_f100
-------------+------------------
      p_f200 |   1.0000
      p_f100 |   0.9996   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          dp |      2,400    .0138682    .0114391   .0000212   .0681703
(obs=2,400)

             |  mu_f200  mu_f100
-------------+------------------
     mu_f200 |   1.0000
     mu_f100 |   0.9982   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         dmu |      2,400    .0138682    .0114391   .0000212   .0681703
(obs=2,400)

             |   s_f200   s_f100
-------------+------------------
      s_f200 |   1.0000
      s_f100 |   0.9958   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ds |      2,400    .0101022    .0065102   5.09e-07    .023591

. foreach v in p mu s {
  2.     corr `v'_f500 `v'_f200
  3.     matrix col = r(rho)  
  4.     gen d`v'= abs(`v'_f500 - `v'_f200)
  5.     summ d`v'
  6.     matrix col = col \ r(mean) \ r(max)
  7.     matrix bottom = bottom, col
  8.     drop d`v'
  9. }
(obs=2,400)

             |   p_f500   p_f200
-------------+------------------
      p_f500 |   1.0000
      p_f200 |   0.9999   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          dp |      2,400    .0051185    .0043988   2.38e-06   .0231683
(obs=2,400)

             |  mu_f500  mu_f200
-------------+------------------
     mu_f500 |   1.0000
     mu_f200 |   0.9996   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         dmu |      2,400    .0051185    .0043988   2.38e-06   .0231683
(obs=2,400)

             |   s_f500   s_f200
-------------+------------------
      s_f500 |   1.0000
      s_f200 |   0.9997   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ds |      2,400    .0023462     .002386   1.12e-08   .0120816

. foreach v in p mu s {
  2.     corr `v'_f1000 `v'_f500
  3.     matrix col = r(rho)  
  4.     gen d`v'= abs(`v'_f1000 - `v'_f500)
  5.     summ d`v'
  6.     matrix col = col \ r(mean) \ r(max)
  7.     matrix bottom = bottom, col
  8.     drop d`v'
  9. }
(obs=2,400)

             |  p_f1000   p_f500
-------------+------------------
     p_f1000 |   1.0000
      p_f500 |   1.0000   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          dp |      2,400    .0033956    .0031517   4.53e-06    .021853
(obs=2,400)

             | mu_f1000  mu_f500
-------------+------------------
    mu_f1000 |   1.0000
     mu_f500 |   0.9998   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         dmu |      2,400    .0033956    .0031517   4.53e-06    .021853
(obs=2,400)

             |  s_f1000   s_f500
-------------+------------------
     s_f1000 |   1.0000
      s_f500 |   0.9999   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ds |      2,400    .0016436    .0016706   1.43e-06   .0116972

. foreach v in p mu s {
  2.     corr `v'_z1000 `v'_f1000
  3.     matrix col = r(rho)  
  4.     gen d`v'= abs(`v'_z1000 - `v'_f1000)
  5.     summ d`v'
  6.     matrix col = col \ r(mean) \ r(max)
  7.     matrix bottom = bottom, col
  8.     drop d`v'
  9. }
(obs=2,400)

             |  p_z1000  p_f1000
-------------+------------------
     p_z1000 |   1.0000
     p_f1000 |   0.9999   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          dp |      2,400    .0047072     .003999   4.77e-06   .0303359
(obs=2,400)

             | mu_z1000 mu_f1000
-------------+------------------
    mu_z1000 |   1.0000
    mu_f1000 |   0.9998   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         dmu |      2,400    .0047072     .003999   4.77e-06   .0303359
(obs=2,400)

             |  s_z1000  s_f1000
-------------+------------------
     s_z1000 |   1.0000
     s_f1000 |   0.9997   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ds |      2,400    .0026322    .0023632   2.20e-07   .0140457

. 
. mat li endog_stats

endog_stats[4,15]
           c1         c1         c1         c1         c1         c1
r1  2.7449528  .70000156  .19007065  2.7312597  .68630846    .186055
r2  .38970183  .16442711  .12390746  .38983192  .15813628  .12416357
r3  1.8510476   .5011096  .00152819   1.846063  .50106049   .0011036
r4  4.6106105  1.6669227  .67119533  4.6103845  1.6523577   .6771971

           c1         c1         c1         c1         c1         c1
r1  2.7361675  .69121625  .18508804  2.7393008  .69434961  .18518413
r2  .38967506  .15889056  .12282645  .38957518  .16084906   .1217747
r3  1.8496242  .50112152  .00119532  1.8491362  .50117064  .00121424
r4  4.6104455  1.6461765  .67402768  4.6104946  1.6544713  .67509216

           c1         c1         c1
r1  2.7346378   .6896866  .18537744
r2  .38982754  .15834949  .12343821
r3  1.8472714  .50114012  .00123734
r4  4.6104641  1.6412827  .67476922

. mat li bottom 

bottom[3,15]
           c1         c1         c1         c1         c1         c1
r1          1          1          1   .9995535  .99815195  .99583086
r2          1          1          1  .01386818  .01386818  .01010225
r3          1          1          1  .06817031  .06817031  .02359095

           c1         c1         c1         c1         c1         c1
r1  .99992944  .99958422  .99972209  .99996168   .9998472  .99985365
r2  .00511851  .00511851  .00234615  .00339556  .00339556  .00164362
r3  .02316833  .02316833  .01208159  .02185297  .02185297  .01169723

           c1         c1         c1
r1  .99994619  .99980059  .99967697
r2  .00470716  .00470716  .00263222
r3   .0303359   .0303359  .01404572

. matrix endog_stats = endog_stats \ bottom

. matrix rownames endog_stats = Mean SD Min Max Correlation MeanDiff MaxDiff 

. matrix colnames endog_stats = Price Markup Share Price Markup Share ///
>   Price Markup Share Price Markup Share Price Markup Share  

. outtable using ../output/endog_stats, mat(endog_stats) format(%9.3fc) nobox

. 
. histogram s_z1000
(bin=33, start=.00123734, width=.02041006)

. graph export ../output/hist_s.pdf, replace
(file ../output/hist_s.pdf written in PDF format)

. twoway scatter p_z1000 mc 

. graph export ../output/p_mc.pdf, replace
(file ../output/p_mc.pdf written in PDF format)

. 
. 
. 
end of do-file


