-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/merger/Analysis/Data Checks/code/../
> output/analysis.log
  log type:  text
 opened on:   6 Oct 2020, 17:00:02

. 
. foreach file in fsolve_100 fsolve_200 fsolve_500 fsolve_1000 zeta_1000 ///
>         lm_1000 lm_1000_badguess zeta_1000_tol {
  2.     import delimited using ../temp/`file'.csv, clear
  3.     rename v1 j
  4.     rename v2 t
  5.     rename v3 x
  6.     rename v4 sat
  7.     rename v5 wire
  8.     rename v6 p
  9.     rename v7 w
 10.     rename v8 xi
 11.     rename v9 omega
 12.     rename v10 s
 13.     rename v11 mc
 14.     save ../temp/`file'.dta, replace
 15. }
(16 vars, 2,400 obs)
(note: file ../temp/fsolve_100.dta not found)
file ../temp/fsolve_100.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/fsolve_200.dta not found)
file ../temp/fsolve_200.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/fsolve_500.dta not found)
file ../temp/fsolve_500.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/fsolve_1000.dta not found)
file ../temp/fsolve_1000.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/zeta_1000.dta not found)
file ../temp/zeta_1000.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/lm_1000.dta not found)
file ../temp/lm_1000.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/lm_1000_badguess.dta not found)
file ../temp/lm_1000_badguess.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/zeta_1000_tol.dta not found)
file ../temp/zeta_1000_tol.dta saved

. 
. use ../temp/fsolve_100.dta, clear

. rename p p_f100 

. rename s s_f100

. merge 1:1 j t x using ../temp/fsolve_200.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_f200

. rename s s_f200

. merge 1:1 j t x using ../temp/fsolve_500.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_f500

. rename s s_f500

. merge 1:1 j t x using ../temp/fsolve_1000.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_f1000

. rename s s_f1000

. /*
> merge 1:1 j t x using ../temp/zeta_1000.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen
> rename p p_z1000
> rename s s_z1000
> */
. merge 1:1 j t x using ../temp/zeta_1000_tol.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_z1000

. rename s s_z1000

. merge 1:1 j t x using ../temp/lm_1000.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_lm1000

. rename s s_lm1000

. merge 1:1 j t x using ../temp/lm_1000_badguess.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_bg

. rename s s_bg

. 
. foreach v in x sat wire w xi omega mc {
  2.     sum `v'
  3.     matrix row = r(N), r(mean), r(sd), r(min), r(max)
  4.     matrix exog_stats = nullmat(exog_stats) \ row
  5. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           x |      2,400    .8058188    .6211158   .0000291    3.45622

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         sat |      2,400          .5    .5001042          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        wire |      2,400          .5    .5001042          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           w |      2,400    .8016445     .600155   .0000186    3.24744

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          xi |      2,400   -.0054473    1.003189  -3.630091   3.258934

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       omega |      2,400   -.0361855    .9937776  -4.240944    3.67225

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          mc |      2,400    2.044951    .4208522   1.239474   4.109324

. matrix rownames exog_stats = x sat wire w xi omega mc

. matrix colnames exog_stats = N Mean SD Min Max

. outtable using ../output/exog_stats, mat(exog_stats) ///
>   format(%9.0fc %9.2fc %9.2fc %9.5fc %9.2fc) nobox 

. 
. foreach suff in f200 f500 f1000 z1000 {
  2.     gen mu_`suff' = p_`suff' - mc
  3.     foreach v in p mu s {
  4.         summ `v'_`suff'
  5.         matrix col = r(mean) \ r(sd) \ r(min) \ r(max)
  6.         matrix endog_stats = nullmat(endog_stats), col
  7.     }
  8. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      p_f200 |      2,400     2.73126    .3898319   1.846063   4.610384

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     mu_f200 |      2,400    .6863085    .1581363   .5010605   1.652358

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      s_f200 |      2,400     .186055    .1241636   .0011036   .6771971

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      p_f500 |      2,400    2.736167    .3896751   1.849624   4.610445

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     mu_f500 |      2,400    .6912163    .1588906   .5011215   1.646176

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      s_f500 |      2,400     .185088    .1228265   .0011953   .6740277

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p_f1000 |      2,400    2.739301    .3895752   1.849136   4.610495

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    mu_f1000 |      2,400    .6943496    .1608491   .5011706   1.654471

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     s_f1000 |      2,400    .1851841    .1217747   .0012142   .6750922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p_z1000 |      2,400    2.736729    .3896778   1.849239   4.610496

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    mu_z1000 |      2,400    .6917778    .1595858   .5011721   1.652738

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     s_z1000 |      2,400    .1854085    .1226962   .0012276   .6733597

. 
. matrix bottom = 1 \ 1 \ 1

. matrix bottom = bottom, bottom, bottom

. foreach v in p mu s {
  2.     corr `v'_f500 `v'_f200
  3.     matrix col = r(rho)  
  4.     gen d`v'= abs(`v'_f500 - `v'_f200)
  5.     summ d`v'
  6.     matrix col = col \ r(mean) \ r(max)
  7.     matrix bottom = bottom, col
  8.     drop d`v'
  9. }
(obs=2,400)

             |   p_f500   p_f200
-------------+------------------
      p_f500 |   1.0000
      p_f200 |   0.9999   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          dp |      2,400    .0051185    .0043988   2.38e-06   .0231683
(obs=2,400)

             |  mu_f500  mu_f200
-------------+------------------
     mu_f500 |   1.0000
     mu_f200 |   0.9996   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         dmu |      2,400    .0051185    .0043988   2.38e-06   .0231683
(obs=2,400)

             |   s_f500   s_f200
-------------+------------------
      s_f500 |   1.0000
      s_f200 |   0.9997   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ds |      2,400    .0023462     .002386   1.12e-08   .0120816

. foreach v in p mu s {
  2.     corr `v'_f1000 `v'_f500
  3.     matrix col = r(rho)  
  4.     gen d`v'= abs(`v'_f1000 - `v'_f500)
  5.     summ d`v'
  6.     matrix col = col \ r(mean) \ r(max)
  7.     matrix bottom = bottom, col
  8.     drop d`v'
  9. }
(obs=2,400)

             |  p_f1000   p_f500
-------------+------------------
     p_f1000 |   1.0000
      p_f500 |   1.0000   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          dp |      2,400    .0033956    .0031517   4.53e-06    .021853
(obs=2,400)

             | mu_f1000  mu_f500
-------------+------------------
    mu_f1000 |   1.0000
     mu_f500 |   0.9998   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         dmu |      2,400    .0033956    .0031517   4.53e-06    .021853
(obs=2,400)

             |  s_f1000   s_f500
-------------+------------------
     s_f1000 |   1.0000
      s_f500 |   0.9999   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ds |      2,400    .0016436    .0016706   1.43e-06   .0116972

. foreach v in p mu s {
  2.     corr `v'_z1000 `v'_f1000
  3.     matrix col = r(rho)  
  4.     gen d`v'= abs(`v'_z1000 - `v'_f1000)
  5.     summ d`v'
  6.     matrix col = col \ r(mean) \ r(max)
  7.     matrix bottom = bottom, col
  8.     drop d`v'
  9. }
(obs=2,400)

             |  p_z1000  p_f1000
-------------+------------------
     p_z1000 |   1.0000
     p_f1000 |   1.0000   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          dp |      2,400    .0026759     .002667   9.54e-07   .0240104
(obs=2,400)

             | mu_z1000 mu_f1000
-------------+------------------
    mu_z1000 |   1.0000
    mu_f1000 |   0.9999   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         dmu |      2,400    .0026759     .002667   9.54e-07   .0240104
(obs=2,400)

             |  s_z1000  s_f1000
-------------+------------------
     s_z1000 |   1.0000
     s_f1000 |   0.9999   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ds |      2,400    .0013151    .0014581   2.76e-07   .0097985

. 
. matrix endog_stats = endog_stats \ bottom

. matrix rownames endog_stats = Mean SD Min Max Correlation MeanDiff MaxDiff 

. matrix colnames endog_stats = Price Markup Share Price Markup Share ///
>   Price Markup Share Price Markup Share  

. outtable using ../output/endog_stats, mat(endog_stats) format(%9.2fc) nobox

. 
. gen mu_lm1000 = p_lm1000 - mc

. gen mu_bg = p_bg - mc

. foreach suff in z1000 lm1000 bg {
  2.     foreach v in p mu s {
  3.         summ `v'_`suff'
  4.         matrix col = r(mean) \ r(sd) \ r(min) \ r(max)
  5.         matrix endog_lm_stats = nullmat(endog_lm_stats), col
  6.     }
  7. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p_z1000 |      2,400    2.736729    .3896778   1.849239   4.610496

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    mu_z1000 |      2,400    .6917778    .1595858   .5011721   1.652738

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     s_z1000 |      2,400    .1854085    .1226962   .0012276   .6733597

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    p_lm1000 |      2,400    2.761251    .6684573   1.849136   16.44304

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   mu_lm1000 |      2,400    .7162993    .5774516   .5011897   14.81734

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    s_lm1000 |      2,400    .1846074    .1207644   1.19e-11   .6244287

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        p_bg |      2,400    3.093665    1.977399   1.849239   16.96387

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       mu_bg |      2,400    1.048714    1.961847   .5011721   15.21924

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        s_bg |      2,400    .1804308    .1253509   6.58e-13   .6921549

. 
. matrix bottom = 1 \ 1 \ 1

. matrix bottom = bottom, bottom, bottom

. foreach v in p mu s {
  2.     corr `v'_z1000 `v'_lm1000
  3.     matrix col = r(rho)  
  4.     gen d`v'= abs(`v'_z1000 - `v'_lm1000)
  5.     summ d`v'
  6.     matrix col = col \ r(mean) \ r(max)
  7.     matrix bottom = bottom, col
  8.     drop d`v'
  9. }
(obs=2,400)

             |  p_z1000 p_lm1000
-------------+------------------
     p_z1000 |   1.0000
    p_lm1000 |   0.6144   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          dp |      2,400    .0246204    .5278019   3.34e-06   13.19378
(obs=2,400)

             | mu_z1000 mu_lm1~0
-------------+------------------
    mu_z1000 |   1.0000
   mu_lm1000 |   0.4359   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         dmu |      2,400    .0246204    .5278019   3.34e-06   13.19378
(obs=2,400)

             |  s_z1000 s_lm1000
-------------+------------------
     s_z1000 |   1.0000
    s_lm1000 |   0.9793   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ds |      2,400    .0025753    .0247096   1.38e-07   .6733597

. foreach v in p mu s {
  2.     corr `v'_lm1000 `v'_bg
  3.     matrix col = r(rho)  
  4.     gen d`v'= abs(`v'_lm1000 - `v'_bg)
  5.     summ d`v'
  6.     matrix col = col \ r(mean) \ r(max)
  7.     matrix bottom = bottom, col
  8.     drop d`v'
  9. }
(obs=2,400)

             | p_lm1000     p_bg
-------------+------------------
    p_lm1000 |   1.0000
        p_bg |   0.1643   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          dp |      2,400    .3694484    1.973993   3.34e-06   13.73545
(obs=2,400)

             | mu_lm1~0    mu_bg
-------------+------------------
   mu_lm1000 |   1.0000
       mu_bg |   0.1146   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         dmu |      2,400    .3694484    1.973993   3.34e-06   13.73545
(obs=2,400)

             | s_lm1000     s_bg
-------------+------------------
    s_lm1000 |   1.0000
        s_bg |   0.9137   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ds |      2,400    .0110069    .0502913   1.07e-10   .6896765

. 
. matrix endog_lm_stats = endog_lm_stats \ bottom

. matrix rownames endog_lm_stats = Mean SD Min Max Correlation MeanDiff MaxDiff
>  

. matrix colnames endog_lm_stats = Price Markup Share Price Markup Share ///
>   Price Markup Share 

. outtable using ../output/endog_lm_stats, mat(endog_lm_stats) format(%9.2fc) n
> obox

. 
. 
. histogram s_z1000
(bin=33, start=.00122764, width=.02036764)

. graph export ../output/hist_s.pdf, replace
(file ../output/hist_s.pdf written in PDF format)

. twoway scatter p_z1000 mc 

. graph export ../output/p_mc.pdf, replace
(file ../output/p_mc.pdf written in PDF format)

. 
. 
. 
end of do-file


