-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/merger/Analysis/Data Checks/code/../
> output/analysis.log
  log type:  text
 opened on:   6 Oct 2020, 18:11:20

. 
. foreach file in fsolve_200 fsolve_500 fsolve_1000 zeta_1000 data_fei {
  2.     import delimited using ../temp/output_1006/`file'.csv, clear
  3.     rename v1 j
  4.     rename v2 t
  5.     rename v3 x
  6.     rename v4 sat
  7.     rename v5 wire
  8.     rename v6 p
  9.     rename v7 w
 10.     rename v8 xi
 11.     rename v9 omega
 12.     rename v10 s
 13.     rename v11 mc
 14.     rename v12 e_p_own
 15.     rename v13 dr1
 16.     rename v14 dr2
 17.     rename v15 dr3
 18.     rename v16 dr4
 19.     save ../temp/`file'.dta, replace
 20. }
(16 vars, 2,400 obs)
(note: file ../temp/fsolve_200.dta not found)
file ../temp/fsolve_200.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/fsolve_500.dta not found)
file ../temp/fsolve_500.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/fsolve_1000.dta not found)
file ../temp/fsolve_1000.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/zeta_1000.dta not found)
file ../temp/zeta_1000.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/data_fei.dta not found)
file ../temp/data_fei.dta saved

. 
. merge 1:1 j t x using ../temp/fsolve_200.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_f200

. rename s s_f200

. drop dr*

. merge 1:1 j t x using ../temp/fsolve_500.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_f500

. rename s s_f500

. merge 1:1 j t x using ../temp/fsolve_1000.dta, assert(3) keep(3) ///
>     keepusing(p s) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_f1000

. rename s s_f1000

. merge 1:1 j t x using ../temp/zeta_1000.dta, assert(3) keep(3) ///
>     keepusing(p s dr*) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_z1000

. rename s s_z1000

. rename dr* dr*_z1000

. merge 1:1 j t x using ../temp/data_fei.dta, assert(3) keep(3) ///
>     keepusing(p s dr*) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  
    -----------------------------------------

. rename p p_fei

. rename s s_fei

. rename dr* dr*_fei

. 
. foreach v in dr1 dr2 dr3 dr4 {
  2.     di "Diversion ratio correlation:"
  3.     corr `v'_fei `v'_z1000
  4.     gen d`v'= abs(`v'_fei - `v'_z1000)
  5.     di "Diversion ratio absolute difference, summary statistics:"
  6.     summ d`v'
  7. }
Diversion ratio correlation:
(obs=2,400)

             |  dr1_fei dr1_z1~i
-------------+------------------
     dr1_fei |   1.0000
dr1_z1000_~i |   0.9907   1.0000

Diversion ratio absolute difference, summary statistics:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ddr1 |      2,400     .006673    .0377908   3.73e-06   .6099932
Diversion ratio correlation:
(obs=2,400)

             |  dr2_fei dr2_z1~i
-------------+------------------
     dr2_fei |   1.0000
dr2_z1000_~i |   0.9881   1.0000

Diversion ratio absolute difference, summary statistics:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ddr2 |      2,400     .006772    .0429472   1.03e-06    .882375
Diversion ratio correlation:
(obs=2,400)

             |  dr3_fei dr3_z1~i
-------------+------------------
     dr3_fei |   1.0000
dr3_z1000_~i |   0.9848   1.0000

Diversion ratio absolute difference, summary statistics:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ddr3 |      2,400    .0062049    .0478722   1.35e-06   .8339779
Diversion ratio correlation:
(obs=2,400)

             |  dr4_fei dr4_z1~i
-------------+------------------
     dr4_fei |   1.0000
dr4_z1000_~i |   0.9895   1.0000

Diversion ratio absolute difference, summary statistics:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ddr4 |      2,400    .0051879    .0394811   1.43e-06   .8260676

. 
. foreach v in x sat wire w xi omega mc {
  2.     sum `v'
  3.     matrix row = r(N), r(mean), r(sd), r(min), r(max)
  4.     matrix exog_stats = nullmat(exog_stats) \ row
  5. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           x |      2,400    .8058188    .6211158   .0000291    3.45622

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         sat |      2,400          .5    .5001042          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        wire |      2,400          .5    .5001042          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           w |      2,400    .8016445     .600155   .0000186    3.24744

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          xi |      2,400   -.0054473    1.003189  -3.630091   3.258934

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       omega |      2,400   -.0361855    .9937776  -4.240944    3.67225

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          mc |      2,400    2.044951    .4208522   1.239474   4.109324

. matrix rownames exog_stats = x sat wire w xi omega mc

. matrix colnames exog_stats = N Mean SD Min Max

. outtable using ../output/exog_stats, mat(exog_stats) ///
>   format(%9.0fc %9.2fc %9.2fc %9.5fc %9.2fc) nobox 

. 
. foreach suff in f200 f500 f1000 z1000 {
  2.     gen mu_`suff' = p_`suff' - mc
  3.     foreach v in p mu s {
  4.         summ `v'_`suff'
  5.         matrix col = r(mean) \ r(sd) \ r(min) \ r(max)
  6.         matrix endog_stats = nullmat(endog_stats), col
  7.     }
  8. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      p_f200 |      2,400     2.73467     .666158  -7.206781   11.15362

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     mu_f200 |      2,400     .689719    .6041581  -10.17455   9.203022

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      s_f200 |      2,400    .1856289    .1298475   5.46e-11          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      p_f500 |      2,400    2.710053    .7201651  -8.086759    10.0044

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     mu_f500 |      2,400    .6651017    .6726018  -11.05453   7.592346

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      s_f500 |      2,400    .1852538    .1341224   1.11e-11          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p_f1000 |      2,400    2.749682    .6358716  -6.323802   10.68719

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    mu_f1000 |      2,400    .7047306    .5674314  -9.292399   8.736591

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     s_f1000 |      2,400    .1856897    .1265793   2.50e-10          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p_z1000 |      2,400    2.735646     .389747    1.84959    4.61045

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    mu_z1000 |      2,400    .6906944    .1586004   .5011263     1.6528

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     s_z1000 |      2,400    .1853932    .1231484   .0012218   .6750148

. 
. matrix bottom = 1 \ 1 \ 1

. matrix bottom = bottom, bottom, bottom

. foreach v in p mu s {
  2.     corr `v'_f500 `v'_f200
  3.     matrix col = r(rho)  
  4.     gen d`v'= abs(`v'_f500 - `v'_f200)
  5.     summ d`v'
  6.     matrix col = col \ r(mean) \ r(max)
  7.     matrix bottom = bottom, col
  8.     drop d`v'
  9. }
(obs=2,400)

             |   p_f500   p_f200
-------------+------------------
      p_f500 |   1.0000
      p_f200 |   0.7274   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          dp |      2,400    .0376351     .513516   .0000253   15.79464
(obs=2,400)

             |  mu_f500  mu_f200
-------------+------------------
     mu_f500 |   1.0000
     mu_f200 |   0.6803   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         dmu |      2,400    .0376351     .513516   .0000253   15.79464
(obs=2,400)

             |   s_f500   s_f200
-------------+------------------
      s_f500 |   1.0000
      s_f200 |   0.9723   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ds |      2,400    .0033438    .0311863          0   .9999945

. foreach v in p mu s {
  2.     corr `v'_f1000 `v'_f500
  3.     matrix col = r(rho)  
  4.     gen d`v'= abs(`v'_f1000 - `v'_f500)
  5.     summ d`v'
  6.     matrix col = col \ r(mean) \ r(max)
  7.     matrix bottom = bottom, col
  8.     drop d`v'
  9. }
(obs=2,400)

             |  p_f1000   p_f500
-------------+------------------
     p_f1000 |   1.0000
      p_f500 |   0.5552   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          dp |      2,400    .0597031    .6422231   .0001321   16.91549
(obs=2,400)

             | mu_f1000  mu_f500
-------------+------------------
    mu_f1000 |   1.0000
     mu_f500 |   0.4715   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         dmu |      2,400    .0597031     .642223   .0001321   16.91549
(obs=2,400)

             |  s_f1000   s_f500
-------------+------------------
     s_f1000 |   1.0000
      s_f500 |   0.9588   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ds |      2,400    .0054247     .037784          0    .999994

. foreach v in p mu s {
  2.     corr `v'_z1000 `v'_f1000
  3.     matrix col = r(rho)  
  4.     gen d`v'= abs(`v'_z1000 - `v'_f1000)
  5.     summ d`v'
  6.     matrix col = col \ r(mean) \ r(max)
  7.     matrix bottom = bottom, col
  8.     drop d`v'
  9. }
(obs=2,400)

             |  p_z1000  p_f1000
-------------+------------------
     p_z1000 |   1.0000
     p_f1000 |   0.5273   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          dp |      2,400    .0458804    .5412557   6.91e-06   9.971264
(obs=2,400)

             | mu_z1000 mu_f1000
-------------+------------------
    mu_z1000 |   1.0000
    mu_f1000 |   0.2904   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         dmu |      2,400    .0458804    .5412557   6.91e-06   9.971264
(obs=2,400)

             |  s_z1000  s_f1000
-------------+------------------
     s_z1000 |   1.0000
     s_f1000 |   0.9569   1.0000


    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ds |      2,400    .0045957    .0365454   3.39e-07   .8630435

. 
. matrix endog_stats = endog_stats \ bottom

. matrix rownames endog_stats = Mean SD Min Max Correlation MeanDiff MaxDiff 

. matrix colnames endog_stats = Price Markup Share Price Markup Share ///
>   Price Markup Share Price Markup Share  

. outtable using ../output/endog_stats, mat(endog_stats) format(%9.2fc) nobox

. 
. histogram s_z1000
(bin=33, start=.00122176, width=.02041797)

. graph export ../output/hist_s.pdf, replace
(file ../output/hist_s.pdf written in PDF format)

. twoway scatter p_z1000 mc 

. graph export ../output/p_mc.pdf, replace
(file ../output/p_mc.pdf written in PDF format)

. 
. 
. 
end of do-file


