-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/merger/Analysis/Data Checks/code/../
> output/analysis.log
  log type:  text
 opened on:   3 Oct 2020, 21:45:26

. 
. foreach method in fsolve zeta {
  2.     import delimited using ../temp/data_`method'.csv, clear
  3.     rename v1 j
  4.     rename v2 t
  5.     rename v3 x
  6.     rename v4 sat
  7.     rename v5 wire
  8.     rename v6 p
  9.     rename v7 w
 10.     rename v8 xi
 11.     rename v9 omega
 12.     rename v10 s
 13.     rename v11 mc
 14.     save ../temp/data_`method'.dta, replace
 15. }
(16 vars, 2,400 obs)
(note: file ../temp/data_fsolve.dta not found)
file ../temp/data_fsolve.dta saved
(16 vars, 2,400 obs)
(note: file ../temp/data_zeta.dta not found)
file ../temp/data_zeta.dta saved

. 
. use ../temp/data_fsolve.dta, clear

. rename p p_fsolve

. rename s s_fsolve

. merge 1:1 j t x using ../temp/data_zeta.dta, assert(3) keep(3) ///
>     keepusing(p s)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,400  (_merge==3)
    -----------------------------------------

. rename p p_zeta

. rename s s_zeta

. reg p_zeta p_fsolve

      Source |       SS           df       MS      Number of obs   =     2,400
-------------+----------------------------------   F(1, 2398)      >  99999.00
       Model |  364.285284         1  364.285284   Prob > F        =    0.0000
    Residual |  5.5856e-06     2,398  2.3293e-09   R-squared       =    1.0000
-------------+----------------------------------   Adj R-squared   =    1.0000
       Total |   364.28529     2,399  .151848808   Root MSE        =    4.8e-05

------------------------------------------------------------------------------
      p_zeta |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    p_fsolve |    1.00003   2.53e-06  4.0e+05   0.000     1.000025    1.000035
       _cons |  -.0000761   6.99e-06   -10.89   0.000    -.0000898   -.0000624
------------------------------------------------------------------------------

. corr p_zeta p_fsolve
(obs=2,400)

             |   p_zeta p_fsolve
-------------+------------------
      p_zeta |   1.0000
    p_fsolve |   1.0000   1.0000


. gen p_diff = p_zeta - p_fsolve

. reg s_zeta s_fsolve

      Source |       SS           df       MS      Number of obs   =     2,400
-------------+----------------------------------   F(1, 2398)      >  99999.00
       Model |  36.1154315         1  36.1154315   Prob > F        =    0.0000
    Residual |  4.1102e-09     2,398  1.7140e-12   R-squared       =    1.0000
-------------+----------------------------------   Adj R-squared   =    1.0000
       Total |  36.1154315     2,399  .015054369   Root MSE        =    1.3e-06

------------------------------------------------------------------------------
      s_zeta |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    s_fsolve |   1.000003   2.18e-07  4.6e+06   0.000     1.000003    1.000003
       _cons |  -6.82e-07   4.84e-08   -14.07   0.000    -7.77e-07   -5.87e-07
------------------------------------------------------------------------------

. corr s_zeta s_fsolve
(obs=2,400)

             |   s_zeta s_fsolve
-------------+------------------
      s_zeta |   1.0000
    s_fsolve |   1.0000   1.0000


. gen s_diff = s_zeta - s_fsolve

. summ *_diff

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      p_diff |      2,400    6.03e-06    .0000497  -4.77e-07   .0012624
      s_diff |      2,400   -1.14e-07    1.36e-06  -.0000279   7.42e-06

. 
. gen mu_fsolve = p_fsolve - mc

. gen mu_zeta = p_zeta - mc

. sum mu_*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   mu_fsolve |      2,400    .6917718    .1595917   .5011506   1.652738
     mu_zeta |      2,400    .6917778    .1595858   .5011721   1.652738

. 
. gen p = p_fsolve

. gen s = s_fsolve

. 
. foreach v in x sat wire p w xi omega s mc {
  2.     sum `v'
  3.     matrix row = r(N), r(mean), r(sd), r(min), r(max)
  4.     matrix summary_stats = nullmat(summary_stats) \ row
  5. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           x |      2,400    .8058188    .6211158   .0000291    3.45622

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         sat |      2,400          .5    .5001042          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        wire |      2,400          .5    .5001042          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           p |      2,400    2.736723    .3896661   1.849239   4.610475

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           w |      2,400    .8016445     .600155   .0000186    3.24744

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          xi |      2,400   -.0054473    1.003189  -3.630091   3.258934

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       omega |      2,400   -.0361855    .9937776  -4.240944    3.67225

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           s |      2,400    .1854086    .1226959   .0012276   .6733597

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          mc |      2,400    2.044951    .4208522   1.239474   4.109324

. matrix rownames summary_stats = x sat wire p w xi omega s mc

. matrix colnames summary_stats = N Mean SD Min Max

. *assert p > mc
. plot p mc

 4.61047 +  
         |                                                                 *
         |                                                               *
         |                                                           **
         |                                                      *** *
         |                                                   ****
         |                                            **   ***
         |                                         * *****
         |                                      *******
         |                  *        * *  **********
    p    |            *          *** * **********
         |         **  *  ** *****************
         |       *** *** * ***************
         |      * *  ******************
         |      ********************
         |     ******************
         |    ***************
         | *** ************
         | ************
         | *********
 1.84924 + *****
          +----------------------------------------------------------------+
          1.23947                       mc                        4.10932


. histogram x
(bin=33, start=.00002911, width=.10473307)

. graph export ../output/hist_x.pdf, replace
(file ../output/hist_x.pdf written in PDF format)

. histogram s
(bin=33, start=.00122764, width=.02036764)

. graph export ../output/hist_s.pdf, replace
(file ../output/hist_s.pdf written in PDF format)

. twoway scatter p mc 

. graph export ../output/p_mc.pdf, replace
(file ../output/p_mc.pdf written in PDF format)

. list j t if s == 0

. collapse (sum) s, by(t)

. assert s <= 1

. sum s

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           s |        600    .7416345    .1025016   .3476709   .9450245

. 
. outtable using ../output/summary_stats, mat(summary_stats) ///
>   format(%9.0fc %9.2fc %9.2fc %9.5fc %9.2fc nobox)

. 
. 
end of do-file


